<?php include("layouts/header.php"); ?>
<div class="container mt-4">
    <h2>นโยบายการใช้คุกกี้ (Cookies Policy)​ </h2>
    <p>
        หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ ให้ความสำคัญกับการกำหนดมาตรการเพื่อคุ้มครองข้อมูลส่วนบุคคลของผู้ใช้เว็บไซต์ โดยเฉพาะอย่างยิ่งสิทธิความเป็นส่วนตัวของผู้เข้าชม และ/หรือ ผู้ใช้เว็บไซต์ และตระหนักถึงความคาดหวังของผู้เข้าชม/ผู้ใช้เว็บไซต์ว่าข้อมูล ที่ผู้เข้าชม/ผู้ใช้เว็บไซต์ได้ให้ไว้กับ ทางหลักสูตรผ่านเว็บไซต์นี้ จะได้รับความคุ้มครองอย่างเหมาะสม หลักสูตรจึงขอประกาศนโยบายการใช้คุกกี้ (“นโยบายการใช้คุกกี้”) สำหรับเว็บไซต์นี้ ดังนี้
    </p>
    <h4>คุกกี้คืออะไร</h4>
    <p>
        คุกกี้ คือ แฟ้มข้อมูลเล็ก ๆ ที่เบราว์เซอร์จัดเก็บรักษาไว้ในคอมพิวเตอร์หรืออุปกรณ์ของท่าน คุกกี้จะช่วยเบราว์เซอร์ของท่านในการนำทางไปยังส่วนต่าง ๆ ภายในเว็บไซต์ อย่างไรก็ตาม คุกกี้ไม่สามารถที่จะรวบรวมข้อมูลที่เก็บบันทึกไว้ในคอมพิวเตอร์ หรือในแฟ้มข้อมูลต่าง ๆ ของท่านได้
    </p>
    <p>
        เมื่อเซิร์ฟเวอร์ขอให้เว็บเบราว์เซอร์อ่านข้อมูลในคุกกี้ ข้อมูลจากคุกกี้จะช่วยให้เว็บไซต์สามารถให้บริการที่เป็นมิตรหรือตรงกับความต้องการของผู้ใช้ได้มากขึ้น เพื่อคุ้มครองความเป็นส่วนตัวของท่าน เบราว์เซอร์จะยอมให้เว็บไซต์เข้าถึงเฉพาะคุกกี้ที่ส่งไปให้ท่านแล้วเท่านั้น
    </p>
    <h4>เหตุผลในการใช้คุกกี้</h4>
    <p>
        เราใช้คุกกี้เพื่อที่จะได้เรียนรู้เพิ่มเติมว่าท่านมีปฏิสัมพันธ์กับเนื้อหาในเว็บไซต์ของเราอย่างไร และเพื่อช่วยในการสร้างสรรค์ประสบการณ์ ที่จะให้ความพึงพอใจแก่ท่านมากยิ่งขึ้น เมื่อท่านเข้าเยี่ยมชมเว็บไซต์ของเรา
    </p>
    <p>
        คุกกี้จะจดจำประเภทของเบราว์เซอร์ที่ท่านใช้ และโปรแกรมเบราว์เซอร์ที่ท่านติดตั้งเพิ่มเติม นอกจากนั้นคุกกี้ยังจะจดจำสิ่งที่ท่านชอบ เช่น ภาษา และ ภูมิภาค ซึ่งจะถูกกำหนดให้เป็นค่าตั้งอัตโนมัติเมื่อท่านกลับเข้ามาเยี่ยมชมเว็บไซต์อีก และคุกกี้จะอนุญาตให้ท่านให้คะแนนเว็บเพจต่างๆ และกรอกแบบฟอร์มแสดงความคิดเห็นด้วย
    </p>
    <p>
        คุกกี้บางตัวที่เราใช้ เป็นคุกกี้แบบช่วงเวลา และจะคงอยู่จนกว่าท่านจะปิดเบราว์เซอร์ที่ท่านใช้ คุกกี้ตัวอื่น ๆ เป็นคุกกี้ถาวร ซึ่งจะถูกเก็บไว้ในคอมพิวเตอร์ของท่าน เป็นระยะเวลาที่นานกว่า
    </p>
    <h4>รายละเอียดคุกกี้แต่ละประเภทที่อาจจะถูกใช้งานในเว็บไซต์มีดังนี้</h4>
    <p>
        คุกกี้ที่จำเป็น (Strictly Necessary Cookies) คุกกี้ประเภทนี้จำเป็นสำหรับการทำงานกับเว็บไซต์ และไม่สามารถปิดการใช้งานในระบบของเราได้ และโดยปกติแล้ว คุกกี้ประเภทนี้จะถูกกำหนดไว้เพื่อตอบสนองต่อการดำเนินการร้องขอบริการของท่าน เช่น การตั้งค่าความเป็นส่วนตัว การเข้าสู่ระบบ หรือการกรอกแบบฟอร์ม ท่านสามารถกำหนดให้เบราว์เซอร์ของท่านทำการบล็อก หรือเตือนให้ท่านทราบเกี่ยวกับคุกกี้ประเภทนี้ แต่นั่นอาจทำให้บางส่วนของไซต์ไม่สามารถทำงานได้
    </p>
    <p>
        คุกกี้เพื่อการวิเคราะห์และเพื่อประสิทธิภาพ (Analytic and Performance Cookies) คุกกี้ประเภทนี้ช่วยเราในการนับจำนวนและที่มาของการเข้าชม เพื่อให้เราสามารถวัดและปรับปรุงประสิทธิภาพไซต์ของเราได้ นอกจากนี้ยังช่วยให้เราทราบว่าหน้าใดได้รับความนิยมมากที่สุดและน้อยที่สุด และทราบว่าผู้เยี่ยมชมเข้าดูส่วนใดบ้าง ข้อมูลทั้งหมดที่คุกกี้ประเภทนี้จัดเก็บไว้จะถูกรวมไว้ด้วยกัน จึงทำให้ไม่สามารถระบุตัวตนได้ หากท่านไม่อนุญาตให้คุกกี้ประเภทนี้ทำงาน เราจะไม่ทราบว่าท่านเข้าชมไซต์ของเราเมื่อใด
    </p>
    <p>
        คุกกี้เพื่อช่วยในการใช้งาน (Functional Cookies) คุกกี้ประเภทนี้ช่วยในการทำงานของไซต์และการปรับแต่งไซต์ให้เหมาะกับผู้ใช้ เช่น วิดีโอและการสนทนาสด คุกกี้ประเภทนั้นอาจได้รับการกำหนดโดยเราหรือผู้ให้บริการจากบริษัทอื่นที่เราได้เพิ่มบริการของพวกเขาลงในหน้าเพจ หากท่านไม่อนุญาตให้คุกกี้ประเภทนี้ทำงาน ฟังก์ชันบางอย่างของไซต์อาจทำงานไม่ถูกต้อง
    </p>
    <p>
        คุกกี้เพื่อปรับเนื้อหาให้เข้ากับกลุ่มเป้าหมาย (Targeting Cookies) คุกกี้ประเภทนี้จะถูกกำหนดผ่านไซต์ของเราโดยพาร์ทเนอร์โฆษณาของเรา โดยบริษัทดังกล่าวอาจใช้คุกกี้ประเภทนี้เพื่อสร้างโปรไฟล์เกี่ยวกับความสนใจของท่าน และแสดงโฆษณาที่ท่านสนใจบนไซต์อื่นๆ คุกกี้ประเภทนี้ทำงานโดยการระบุแต่ละเบราว์เซอร์และอุปกรณ์ของท่าน หากท่านไม่อนุญาตให้คุกกี้ประเภทนี้ทำงาน ท่านจะไม่เห็นโฆษณาที่ท่านเป็นเป้าหมายบนเว็บไซต์ต่างๆ
    </p>
    <h4> การใช้คุกกี้โดยบุคคลที่สาม (Third-Party Cookies)</h4>
    <p>
        เว็บไซต์ของเรามีการใช้คุกกี้โดยบุคคลที่สาม อันประกอบไปด้วย คุกกี้เพื่อการวิเคราะห์และเพื่อประสิทธิภาพ (Analytic and Performance Cookies) เช่น Google Analytics และ คุกกี้เพื่อปรับเนื้อหาให้เข้ากับกลุ่มเป้าหมาย (Targeting Cookies) เช่น google.com youtube.com และ facebook.com ซึ่งเป็นผู้ให้บริการการวิเคราะห์ และ ปรับเนื้อหาให้เข้ากับกลุ่มเป้าหมาย ที่แพร่หลายและได้รับการไว้วางใจเป็นอย่างมาก ซึ่งช่วยให้บริษัทเข้าใจว่าท่านใช้เว็บไซต์ของบริษัทอย่างไร และ เข้าใจแนวทางในการปรับปรุงประสบการณ์การใช้งานเว็บไซต์ของท่านให้ดียิ่งขึ้น
    </p>
    <p>
        อย่างไรก็ตาม อาจมีคุกกี้โดยบุคคลที่สามที่เราไม่สามารถควบคุมการใช้ข้อมูลของบุคคลที่สามนั้นได้ ดังนั้นท่านสามารถตรวจสอบ นโยบายความเป็นส่วนตัว (Privacy Notice) และ นโยบายการใช้คุกกี้ของบุคคลที่สาม ซึ่งแตกต่างจากเว็บไซต์ของเราได้ที่เว็บไซต์ของบุคคลที่สามนั้น ๆ
    </p>
    <h4> การเปลี่ยนแปลงการตั้งค่าคุกกี้</h4>
    <p>
        ท่านสามารถเลือกตั้งค่าคุกกี้แต่ละประเภท ยกเว้น คุกกี้ที่จำเป็น (Strictly Necessary Cookies) ได้ โดย “การตั้งค่าคุกกี้” หรือ การตั้งค่าในเว็บบราวเซอร์ (web browser) เช่น ห้ามการติดตั้งคุกกี้ลงบนอุปกรณ์ของท่าน
    </p>
    <p>
        อย่างไรก็ตาม หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ ขอแจ้งให้ท่านทราบว่า การปิดการใช้งานคุกกี้บางตัวอาจส่งผลกระทบต่อการทำงานของเว็บไซต์นี้ และ อาจส่งผลให้ท่านไม่สามารถใช้เว็บไซต์ต่าง ๆ ได้อย่างมีประสิทธิภาพ
    </p>
</div>
<?php include("layouts/footer.php"); ?>