<?php include("layouts/header.php"); ?>

<!-- start content -->
<div class="container">
   <br />
   <h2>&starf;&nbsp;ประวัติหลักสูตร</h2>
   <hr>
       <h4>&#187;ชื่อหน่วยงาน</h4>
       <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;สาขาวิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์</p>
	   <hr>
	   <h4>&#187;ที่ตั้ง</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;อาคาร 75 ปี วไลยอลงกรณ์ คณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ เลขที่ 1 หมู่ที่ 20 ตำบลคลองหนึ่ง อำเภอคลองหลวง จังหวัดปทุมธานี 13180</p>
	   <hr>
	   <h4>&#187;ประวัติความเป็นมาของหลักสูตร</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;การบริหารและการจัดการการศึกษาสาขาวิทยาการคอมพิวเตอร์ ดำเนินการมาตั้งแต่ปี พ.ศ.2528 ในขณะนั้นบริหารและจัดการในรูปแบบของภาควิชาคอมพิวเตอร์ ภายใต้การดูแลของอาจารย์อำนาจ มั่นทน หัวหน้าโปรแกรมวิชา และผู้ช่วยศาสตราจารย์มนูญ แก้วราตรี รองหัวหน้าโปรแกรมวิชา มีการเปิดรับนักศึกษาครั้งแรกในปี พ.ศ.2529 โดยเปิดสอนในระดับอนุปริญญาคอมพิวเตอร์ ในปี พ.ศ.2536 เปิดสอนนักศึกษาทั้งภาคปกติและภาคการศึกษาเพื่อบุคลากรประจำการ (กศ.บป.) ในระดับอนุปริญญาคอมพิวเตอร์ ในปี พ.ศ. 2539 เปิดสอนในระดับปริญญาตรี หลักสูตรสาขาวิทยาศาสตร์ เอกวิทยาการคอมพิวเตอร์ รุ่นที่ 1 โดยเปิดสอนนักศึกษาทั้งในภาคปกติ และภาค กศ.ปช. ในปี พ.ศ. 2540 เพื่อให้การจัดการศึกษาและการดูแลเอาใจใส่นักศึกษามีความใกล้ชิดมากขึ้น และช่วยให้การใช้ทรัพยากรทางการศึกษาคุ้มค่าและเกิดประโยชน์สูงสุด จึงมีการเปลี่ยนรูปแบบการบริหารและการจัดการจากภาควิชาคอมพิวเตอร์เป็น โปรแกรมวิชาวิทยาการคอมพิวเตอร์</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ในปี พ.ศ. 2548 ทางมหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ ได้เปลี่ยนรูปแบบการบริหารและจัดการโปรแกรมวิชาเป็นสาขาวิชาและหลักสูตร พร้อมกับกำหนดให้มีกรรมการบริหารหลักสูตรอย่างน้อย 5 คน เพื่อทำหน้าที่ประสานงานกับคณะ อาจารย์ และนักศึกษาในทุกๆ เรื่องที่เกี่ยวข้อง</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ในปี พ.ศ. 2549 หลักสูตรวิทยาการคอมพิวเตอร์ ได้ปรับปรุงหลักสูตรเดิมให้สอดคล้องกับความเปลี่ยนแปลงและความต้องการของ สังคม และเปิดใช้หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิทยาการคอมพิวเตอร์ (ปรับปรุง) ตั้งแต่ภาคเรียนที่ 1 ปีการศึกษา 2550 จนถึงจนถึงภาคเรียนที่ 2 ปีการศึกษา 2554</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ในปี พ.ศ. 2554 หลักสูตรวิทยาการคอมพิวเตอร์ ได้พัฒนาหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ หลักสูตรปรับปรุง พ.ศ. 2555 ตามประกาศกระทรวงศึกษาธิการ เรื่อง กรอบมาตรฐานคุณวุฒิ ระดับอุดมศึกษาแห่งชาติ พ.ศ. 2552 และเริ่มเปิดใช้ตั้งแต่ภาคเรียนที่ 1 ปีการศึกษา 2555</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ในปี พ.ศ. 2559 หลักสูตรวิทยาการคอมพิวเตอร์ ได้พัฒนาหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ หลักสูตรปรับปรุง พ.ศ. 2560 ตามประกาศกระทรวงศึกษาธิการ เรื่อง กรอบมาตรฐานคุณวุฒิ ระดับอุดมศึกษาแห่งชาติ พ.ศ. 2558 และเริ่มเปิดใช้ตั้งแต่ภาคเรียนที่ 1 ปีการศึกษา 2560 เป็นต้นไป</p>
	   
</div>
<!-- end content -->

<br/>

<!-- start footer -->   

<?php include("layouts/footer.php"); ?>