<?php include("layouts/header.php"); ?>
<div class="container">
   <br />
   <h2>&starf;&nbsp;ปรัชญา/วิสัยทัศน์/พันธกิจ</h2>
   <hr>
       <h4>ปรัชญาของหลักสูตร</h4>
       <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ปรัชญา : มุ่งผลิตบัณฑิตที่มีความรู้ ทักษะทางวิทยาการคอมพิวเตอร์ มีคุณธรรม จริยธรรม และทำงานร่วมกับผู้อื่น เพื่อตอบสนองหน่วยงานภาครัฐและเอกชน</p>
	   <hr>
	   <h4>วิสัยทัศน์</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;วิสัยทัศน์ : มุ่งผลิตบัณฑิตหลักสูตรวิทยาการคอมพิวเตอร์ ที่มีคุณภาพสนองความต้องการของท้องถิ่นและสังคม</p>
	   <hr>
	   <h4>พันธกิจ</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;พันธกิจ : มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ มีภาระหน้าที่ในการปฏิบัติภารกิจต่างๆดังที่ปรากฏในพระราชบัญญัติมหาวิทยาลัยราชภัฏ พ.ศ. 2547 ซึ่งพระบาท  สมเด็จพระเจ้าอยู่หัวทรงพระกรุณาโปรดเกล้าฯ ทรงลงพระปรมาภิไธยและได้ประกาศในพระราชกิจจานุเบกษา เมื่อวันที่ 14 มิถุนายน 2547</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;มาตรา7 ให้มหาวิทยาลัยเป็นสถาบันอุดมศึกษาเพื่อการพัฒนาท้องถิ่นที่เสริมสร้างพลังปัญญาของแผ่นดิน ฟื้นฟูพลังการเรียนรู้ เชิดชูภูมิปัญญาท้องถิ่น สร้างสรรค์ศิลปวิทยา เพื่อความเจริญ  ก้าวหน้าอย่างมั่งคงและยั่งยืนของปวงชน มีส่วนร่วมในการจัดการ การบำรุงรักษา การใช้ประโยชน์จากทรัพยากรธรรมชาติและสิ่งแวดล้อมอย่างสมดุลและยั่งยืน โดยมีวัตถุประสงค์ให้การ  ศึกษา ส่งเสริมวิชาการและวิชาชีพชั้นสูง ทำการสอน วิจัย ให้บริการทางวิชาการแก่สังคม ปรับปรุง ถ่ายทอด และพัฒนาเทคโนโลยี ทะนุบำรุงศิลปวัฒนธรรม ผลิตครู และส่งเสริมวิทยฐานะครู</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;มาตรา8 ในการดำเนินงานเพื่อให้บรรลุวัตถุประสงค์ตามมาตรา 7 ให้กำหนดภาระหน้าที่ของมหาวิทยาลัยดังนี้</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(1)แสวงหาความจริงเพื่อสู่ความเป็นเลิศทางวิชาการบนพื้นฐานของภูมิปัญญาท้องถิ่น ภูมิปัญญาไทย และภูมิปัญญาสากล</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(2)ผลิตบัณฑิตที่มีความรู้คู่คุณธรรม สำนึกในความเป็นไทย มีความรักและผูกพันต่อท้องถิ่นอีกทั้งส่งเสริมการเรียนรู้ตลอดชีวิต เพื่อช่วยให้คนในท้องถิ่นรู้เท่าทันการเปลี่ยนแปลง และ  ผลิตบัณฑิตดังกล่าวจะต้องให้มีจำนวนและคุณภาพสอดคล้องกับแผนการผลิตบัณฑิตของประเทศ</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; (3) เสริมสร้างความรู้ความเข้าใจในคุณค่า ความสำนึก และความภูมิใจในวัฒนธรรมของท้องถิ่นของชาติ</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(4)เรียนรู้และเสริมสร้างความเข้มแข็งของผู้นำชุมชน ผู้นำศาสนา และนักการเมืองท้องถิ่นให้มีจิตสำนึกประชาธิปไตย คุณธรรม จริยธรรม และความสามารถในบริหารงานพัฒนาชุมชน  และท้องถิ่นเพื่อประโยชน์ของส่วนรวม</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(5)เสริมสร้างความเข้มแข็งของวิชาชีพครู ผลิตและพัฒนาครูและบุคลากรทางการศึกษาให้มีคุณภาพและมาตรฐานที่เหมาะสมกับการเป็นวิชาชีพชั้นสูง</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(6)ประสานความร่วมมือและช่วยเหลือเกื้อกูลกันระหว่างมหาวิทยาลัย ชุมชน องค์กรปกครองส่วนท้องถิ่นและองค์กรอื่นทั้งในและต่างประเทศ เพื่อการพัฒนาท้องถิ่น</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(7)ศึกษาและแสวงหาแนวทางพัฒนาเทคโนโลยีพื้นบ้านและเทคโนโลยีสมัยใหม่เหมาะสมกับการดำรงชีวิต และการประกอบอาชีพของคนในท้องถิ่น รวมถึงการแสวงหาแนวทางเพื่อส่ง  เสริมให้เกิดการจัดการ การบำรุงรักษา และการใช้ประโยชน์จากทรัพยากรธรรมชาติและสิ่งแวดล้อมอย่างสมดุลและยั่งยืน</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(8) ศึกษา วิจัย ส่งเสริมและสืบสานโครงการอันเนื่องมาจากแนวพระราชดำริในการปฏิบัติภารกิจของมหาวิทยาลัย เพื่อการพัฒนาท้องถิ่น</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ในการดำเนินงานเพื่อให้บรรลุผลตามวิสัยทัศน์และพันธกิจนั้น สาขาวิชาวิทยาการคอมพิวเตอร์ ได้ยึดสาระตามแผนการบริหารราชการแผ่นดิน</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;พ.ศ. 2553-2556 และในพระราชกฤษฎีกาว่าด้วยหลักเกณฑ์และวิธีการบริหารกิจการบ้านเมืองที่ดี พ.ศ. 2546 เป็นสำคัญพร้อมทั้งกำหนดเป้าประสงค์และประเด็นยุทธศาสตร์ในการ  ปฏิบัติราชการสอดคล้องตามที่คณะกำหนดไว้เป็นสำคัญ</p>
	   <hr>
	   <h4>วัตถุประสงค์</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1) เพื่อผลิตบัณฑิตที่มีความรู้ ความสามารถ มีทักษะด้านวิทยาการคอมพิวเตอร์และทักษะภาษาต่างประเทศ ทั้งด้านวิชาการและวิชาชีพ ในภาครัฐและเอกชน</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2) เพื่อผลิตบัณฑิตที่มีเจตคติที่ดี มีคุณธรรม จริยธรรม มีระเบียบวินัย ขยันหมั่นเพียร มีความสำนึกในจรรยาบรรณวิชาชีพ และมีความรับผิดชอบต่อหน้าที่และสังคม</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3) เพื่อผลิตบัณฑิตที่มีพื้นฐานความรู้ที่สามารถศึกษาต่อระดับที่สูงขึ้น และสามารถศึกษาเพิ่มเติมได้ด้วยตนเอง ตลอดจนสามารถถ่ายทอดความรู้สู่ชุมชนได้</p>	   
</div>
<?php include("layouts/footer.php"); ?>
</div>
</body>
</html>