<?php include("layouts/header.php"); ?>
<div class="container">
   <br />
   <h2>&starf;&nbsp;นโยบายด้านคุณภาพ</h2>
   <hr>
       <h4>สาขาวิชาวิทยาการคอมพิวเตอร์ </h4>
       <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; คณะวิทยาศาสตร์และเทคโนโลยี ได้ดำเนินการประกันคุณภาพตามกรอบที่กำหนดโดยคณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ จังหวัดปทุมธานี โดยดำเนินการดังนี้สาขาวิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์และเทคโนโลยี ได้ดำเนินการประกันคุณภาพตามกรอบที่กำหนดโดยคณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ จังหวัดปทุมธานี โดยดำเนินการดังนี้</p>
	   <hr>
	   <h4>การบริหารหลักสูตร</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1)มีการจัดตั้งคณะกรรมการบริหารหลักสูตรทำหน้าที่รับผิดชอบควบคุมกำกับและดูแลด้านการจัดการศึกษา การพัฒนา และบริหารหลักสูตรสาขาวิชาวิทยาการคอมพิวเตอร์ เพื่อให้ได้มาตรฐานตามเกณฑ์มาตรฐานหลักสูตรระดับอุดมศึกษา พ.ศ. 2548 และกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2)มีการจัดโครงสร้างหลักสูตรตามเกณฑ์ที่สำนักงานคณะกรรมการการอุดมศึกษาและมหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ ตลอดจนคณะวิทยาศาสตร์และเทคโนโลยี ประกาศใช้เป็นหลักสูตร</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3)จัดผู้สอนที่มีคุณวุฒิ ความรู้ ความสามารถและประสบการณ์ที่ตรงกับเนื้อหาในหลักสูตร</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4)คณะกรรมการบริหารคณะเป็นผู้กำกับดูแลการปฏิบัติงานของคณะกรรมการบริหารหลักสูตร</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;5) มีการประเมินการเรียนของนักศึกษา และประเมินการสอนของอาจารย์ผู้สอนโดยนักศึกษาทุกรายวิชาในแต่ละภาคการศึกษา</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;6)จัดให้มีการคัดเลือกนักศึกษา โดยใช้มาตรฐานและเกณฑ์ทางการศึกษาตามระเบียบมหาวิทยาลัยราชภัฏวไลยอลงกรณ์ และระบบประกันคุณภาพการศึกษาของคณะวิทยาศาสตร์และเทคโนโลยี</p>
	   <hr>
	   <h4>ทรัพยากรประกอบการเรียน</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;มีการจัดการเรียนการสอนให้เหมาะสมและจัดให้มีสถานที่และอุปกรณ์การเรียนการสอนอย่างทันสมัยและพอเพียง โดยมีความร่วมมือกับชุมชนและหน่วยงานภายนอก</p>
	   <hr>
	   <h4>การสนับสนุนและการให้คำแนะนำนักศึกษา</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;มีการแต่งตั้งอาจารย์ที่ปรึกษาและจัดกิจกรรมเพื่อพัฒนาให้นักศึกษามีคุณลักษณะที่พึงประสงค์ของความเป็นนักวิทยาศาสตร์ มีคุณธรรม จริยธรรม และความรับผิดชอบ</p>
	   <hr>
	   <h4>ความต้องการของตลาดแรงงาน สังคม หรือความพึงพอใจของผู้ใช้บัณฑิต</h4>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1) มีการกำหนดคุณลักษณะของบัณฑิตที่พึงประสงค์ เพื่อดำเนินการผลิตบัณฑิตให้สอดคล้องกับความต้องการของสังคม</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2) จัดให้มีระบบการตรวจสอบ การวัด และการประเมินผลการผลิตบัณฑิตและมีการประเมินผลเชิงระบบในภาพรวมให้สอดคล้องกับความต้องการของผู้ใช้บัณฑิต</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3)มีการติดตามประเมินคุณภาพของนักศึกษาทั้งที่กำลังศึกษาอยู่ และบัณฑิตที่ทำงานแล้ว เพื่อนำมาปรับปรุงและพัฒนาหลักสูตรทุก 5 ปี เพื่อให้สอดคล้องกับสภาพการณ์การเปลี่ยนแปลงของสังคม</p>
	   <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4) จัดให้มีการสำรวจการมีงานทำของบัณฑิต</p>   
</div>
<?php include("layouts/footer.php"); ?>
