<?php include("layouts/header.php"); ?>
<div class="container">
   <br />
   <h2>&starf;&nbsp;รับสมัครนักศึกษาใหม่ 2561 หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์</h2>
   <hr>
       
  <p>
<img src="images/Banner2.png" alt="รับสมัครนักศึกษาใหม่ 2561 หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์" width="981" height="538" />
</p>

<h4>กำหนดการรับสมัคร</h4>
<p>
&nbsp; &nbsp; &nbsp; &nbsp;หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ ประกาศรับสมัครนักศึกษา เพื่อเข้าศึกษาต่อในปีการศึกษา 2561 ตั้งแต่บัดนี้เป็นต้นไป 
</p>

<h4>การรับสมัคร (ออนไลน์)</h4>
<ul>
 	<li><a href="http://web2020.vru.ac.th/DefaultNK.aspx">ประเภทโควต้า</a></li>
 	<li><a href="http://web2020.vru.ac.th/DefaultN.aspx">ประเภทรับตรง</a></li>
</ul>
<h4>เว็บไซต์</h4>
<ul>
 	<li><a href="http://sci.vru.ac.th">คณะวิทยาศาสตร์และเทคโนโลยี</a></li>
 	<li><a href="http://www.vru.ac.th/">มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์</a></li>
</ul>
<h4>ติดต่อสอบถาม</h4>
&nbsp; &nbsp; &nbsp; &nbsp;คณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์ เลขที่ 1 หมู่ 20 ต.คลองหนึ่ง อ.คลองหลวง จ.ปทุมธานี 13180<br />
&nbsp; &nbsp; &nbsp; &nbsp;<strong>โทรศัพท์ :</strong> 02-529-3850<strong>โทรสาร :</strong> 02-909-3029<strong>E-Mail :</strong> sciencetech@vru.ac.th
</div>
<?php include("layouts/footer.php"); ?>
</div>
</body>
</html>